In [18]:
import pandas as pd
 
dict = {'name' : ['Martha', 'Tim', 'Rob', 'Georgia'],
        'math' : [87, 91, 97, 95],
        'sci' : [83, 99, np.nan, 76]}
df = pd.DataFrame(dict)
 
df

      name  math   sci
0   Martha    87  83.0
1      Tim    91  99.0
2      Rob    97   NaN
3  Georgia    95  76.0

In [23]:
df[1:2] # срез строк

  name  math   sci
1  Tim    91  99.0

In [8]:
df.query('math != 97') # Срез методом .query

      name  math   sci
0   Martha    87  83.0
1      Tim    91  99.0
3  Georgia    95  76.0

In [9]:
df[df['math'] != 97] # Срез True/False

      name  math   sci
0   Martha    87  83.0
1      Tim    91  99.0
3  Georgia    95  76.0

In [15]:
df['math'].isin([87]) # Срез методом .isin

0     True
1    False
2    False
3    False
Name: math, dtype: bool

# список остался как есть

In [24]:
df

      name  math   sci
0   Martha    87  83.0
1      Tim    91  99.0
2      Rob    97   NaN
3  Georgia    95  76.0